//["normal","сердито","извиняющимся тоном","с удивлением","вопросительно"]

CrabbyText = {

	homepage : [
		[
			"Ты можешь авторизоваться на сайте World of Warcraft со своей учетной записи Battle.net: тогда главная страница будет показываться в персональном форматировании. Попробуй!",
			{
				text : "Прикрепленные статьи выводятся в верхней части общего списка. Если ты в непонятках, куда смотреть, — начни с них.",
				option : {
					list : {
						"В непонятках?" : {
							text : "Ну типа да. Так же говорят, нет?",
							mood : "вопросительно",
							option : {
								list : {
									"Сомневаюсь" : {
										text : "Ну если честно, мне просто попалось выражение и до смерти хотелось его куда-нибудь приткнуть.",
										mood : "Извиняюсь!",
										option : {
											list : {
												"Да ладно. В общем, вполне к месту." : { 
													text : "Уф! А то я, знаешь, так волнуюсь, когда у меня слова начинают лезть из мандибулы.",
													option : {
														list : {
															"Откуда, пардон? Из какой такой мандибулы?" : {
																text : "Челюстная кость, крепится к черепу. Слушай, ты бы полистал словарь, что ли. Или мне каждое слово теперь тебе объяснять?",
																mood : "сердитый",
																option : {
																	list : {
																		"Первый раз слышу, чтобы у крабов были мандибулы. Я думал, это только у насекомых." : {
																			text : "Да ну? А по-моему, есть. По крайней мере, нам на уроке глубоководной биологии так говорили.",
																			mood : "вопросительно",
																			option : {
																				list : {
																					"А я в Интернете читал" : {
																						text : "Значит, все-таки правда?",
																						mood : "вопросительно"
																					},
																					"Да не знаю я." : "Слушай, может, все-таки про компьютерные игрушки поговорим? А то у меня от этого аквариумного трепа уже в горле свербит."
																				}
																			}
																		},
																		"Ты там что-то говорил про словарь?" : {
																			text : "Хр-р, хр-р. Думаешь, скелет отрастил — и самый умный? <br/><br/><b style=\"color:red\">Крабик решительно возражает: -5</b>",
																			mood : 'сердито'
																		}
																	}
																}
															},
															"Так о чем бишь мы?" : {
																text : "Не помню. Про спорт вроде.",
																mood : "вопросительно",
																option : {
																	list : {
																		"Вряд ли." : "У крабов очень ограниченная кратковременная память. Нам главное — выглядеть понеаппетитнее перед морскими выдрами.",
																		"Ясно. Ну так вот, насчет той команды..." : {
																			text : "Ах да... Ну, они, само собой, зажигают в чемпионате.",
																			mood : "вопросительно",
																			option : {
																				list : {
																					"Особенно ногастый чувак." : {
																						text : "Точно. <br/> .... <br/> Слушай, может, хорош уже об этом? У меня от этого разгула тестостерона глаза уже не то что навыкате, а прямо-таки на мокром месте.",
																						mood : "с удивлением",
																						option : {
																							list : {
																								"Ох..." : "... <br/> <br/> А вот погода так погода, да!",
																								"Ну так о чем поговорим?" : "Да не знаю я. Ты там случайно на Тол Барад не опаздываешь?"
																							}
																						}
																					}
																				}
																			}
																		}
																	}
																}
															}
														}
													}
												},
												"Умолкни уже!" : "Слушаюсь, шеф."
											}
										}										
									},
									"Может, в каких-нибудь пошлых любовных романчиках..." : {
										text : "Слушай, приятель, я же не лезу к тебе издеваться над твоими литературными вкусами!",
										mood : "сердито",
										option : {
											list : {
												"Ш-ш, Крабик, успокойся." : "Давай лучше... о чем мы там говорили?",
												"Легче на поворотах, моллюск!" : {
													text : "Раскомандовался, человек! Крабик не признает приказов от мешков с мясом!",
													mood : "сердито"
												}
											}
										}
									}
								}
							}
						}
					}
				}
			},
			"А ты в курсе, что каждый день публикуется новый скриншот дня?"
		],
		[
			"На сайте сообщества World of Warcraft есть чем заняться.",
			"Ух ты! Если приглядеться, там в узоре фона — всевидящее око иллюминатов в языках пламени. Честное слово!"
		],
		[
			"Смертокрыл явно сердится."
		],
		[
			"Ты да я — больше никаких людей и нет на свете."
		]
	],
	
	blog : [
		[ 	
			"Ты тут вроде как блог читаешь. Поискать тебе какие-нибудь слова?",
			 "Ты в курсе, что в блоге можно оставлять комментарии? Попробуй!",
			 "Если тебе нравится сообщение, можешь щелкнуть по кнопке Facebook («Мне нравится») под текстом – поделиться с друзьями.",
			 "Я обожаю читать комментарии. Игроки часто пишут что-нибудь эдакое, слово за слово, завязывается интересный разговор.",
			 "Справа на странице выводится несколько сообщений по той же теме. Не обойди их стороной!",
			 { 
			 	text : "Если не знаешь, как оставить комментарий, спроси!",
				option : {
					list : {
						"Помоги мне, Крабик! " : "Чтобы оставить комментарий, войди на сайт со своей учетной записи Battle.net и щелкни по кнопке «Ответить». Вот!"
					}
				}
			 },
			 "А ты знаешь, что искусство блогописания восходит к древним ракообразным Юрского периода?"
		],
		
		[ 
			"Оставить комментарий проще простого! Сам попробуй!",
			"Когда ты оставляешь под сообщением комментарий, автор видит, что ты интересуешься!",
			"Попишу в блогах — и на душе улыбается.",
			"Я люблю большие, наливные блоги. Что уж тут скрывать."
		],
		
		[ 
			"Те, кто здесь пишет, вкладывают много времени и сил.",
			{ 	
				text : "GhostCrawler наверняка симпатичный парень. <br/> ... <br/>  Знать бы еще, как определяется пол у крабов.",
				mood : "вопросительно"
			}
		],	
		[
			"Я уверен, остальные игроки с удовольствием почитают, что ты напишешь!"
		],
		[
			"Я знаю, ты занят, но, может, выкроишь минутку поделиться мнением?"
		],
		[
			{
				text : "Ты точно не хочешь ничего писать?",
				moood : "сердито",
				option : {
					list : {
						"Крабик, отстань!" : "Елки-палки, я таки психанул будь здоров!",
						"Ладно, ладно, напишу что-нибудь." : {
							text : "...Прости. Перегнул палку.",
							mood : "извиняющимся тоном"
						}
					}
				}				
			}
		]
	],
		
	forum : [
		[
			/*
			(if they replied) I see that you replied to this thread. Very good response!
			*/
			 
			"Ты любишь читать форумы? Я тоже! А любимый форум у тебя есть? Может, тебе посмотреть еще какие-нибудь, где ты редко бываешь? Разнообразие красит жизнь!",
			"Есть такие умные, конструктивные, хорошо написанные сообщения, что за них грех не проголосовать. Проголосуй, и общественность будет тебе благодарна.",
			"Бывают сообщения такие нехорошие, что их надо топить. Цивильно, конечно: надо голосовать против них. Поработай санитаром форумов!",
			"Не забывай, другие участники форумов – тоже люди. Доброе слово и друиду приятно. Так давай, что ли, говорить друг другу комплименты...",
			
			"Знаешь, есть такая фишка – можно щелкнуть по имени персонажа, и откроется его профиль в Оружейной!",
			"Как насчет поролевить? Айда на ролевой форум!"
		],
		
		[
			"Много миллиардов лет назад весь Интернет был — сплошные службы BBS да сообщества Usenet. Легенды передавались из уст в уста по shareware, пользователи делились друг с другом мечтами и надеждами и общались с единомышленниками ночи напролет, пока не займется заря... или не позвонит кто-нибудь по телефону и не оборвет модем."
		],
		
		[
			{ 	
				text : "Кто-нибудь еще играет в Saga of the Purple Draconid? Хорошая игра.",
				mood : "вопросительно",
				option: {
					list : {
						"Не знаю..." : "Пускай играют. Сходи в приемную к своему депутату, объясни ему.",
						"Может, и играют." : "Так держать. Надежда умирает последней!"
					}
				}
			}
		],
		
		[
			"Я капитан Крабик. то мой любимый форум на сайте!"
		],
		
		[
			{
				text : "Если кто-нибудь тебе что-нибудь не то шепчет в игре, стукни на него ГМу!",
				mood : "с удивлением"	
			},
			{
				text : "Я тут на днях пасся на травке, никого не трогал, не шалил, починял примус... Как вдруг является какой-то малолетний хулиган и порывается сунуть меня в пакет. И при этом бубнит что-то вроде: <em>\«Надо их всех отловить».\"</em>",
				mood : "извиняющимся тоном"
			}
		],
		
		[			
			{
				text : "Если у тебя одна клешня маленькая, а другая большая, — значит, ты краб-мальчик!",
				mood : "с удивлением"
			},
			
			{
				text : "Если кто-нибудь попробует тебе втирать, что если колошматить вдвоем по одной клавиатуре, то никакой хакер не взломает тебе файервол, — гони его в шею большой клешней!",
				mood : "сердито"
			},
			
			{
				text : "Если я скажу, что у тебя скорлупка просто загляденье, это может быть использовано против меня?",
				mood : "вопросительно"
			},
			
			{ 
				text : "Давай смореть правда в глаза. Никто тут на твой alt-троллинг не поведется.",
				mood : "сердито"
			}
		],
		[
			{
				text : "<span style=\"-webkit-transform: rotate(-180deg); -moz-transform: rotate(-180deg);\">Меня зовут Крабик, а ты кто? Моя мамочка??</span>",
				mood : "извиняющимся тоном"
			},
			{ 
				text : "Продаю тонкие кожаные панцири... Панц-и-ри или панц-ы-ри?",
				option : {
					list : {
						"Что-что?" : {
							text : "Слушай, будь другом, глянь на Грамоте, как это пишется?",
							option : {
								list : {
									"Сейчас." : {
										text : "...<br/><br/>Ну?",
										option : {
											list : {
												"Вообще-то я не посмотрел." : {
													text : "Ну елы-палы! Я тут рву клешни, понимаешь, мечу перед ним премудрость пригоршнями, как чистый жемчуг, а он мне бусинку жалеет!",
													mood : 'сердито',
													option : {
														list : {
															"Не обижайся. У меня просто на Грамоту аллергия." : "Ой, тогда прости, пожалуйста. Понимаю. У меня у самого аллергия на устриц.",
															"Ладно, ладно. Пишется <b>«панцири»</b>." : "Правда? Хотя вообще это было предсказуемо. Мерси!"
														}
													}													
												},
												"Пишется... <em>«панцыри»</em>" : {
													text : "Погоди... Что-то слишком былинно выглядит...",
													mood : 'вопросительно',
													option : {
														list : {
															"" : "",
															"" : ""
														}
													}
												}
											}
										}										
									},
									"А самому посмотреть слабо?" : {
										text : "У меня выход в Интернет с работы ограничен. Перефармил чуток."
									}
								}
							}										
						},
						"Да какая разница, Крабик?" : "Вам, толстомясым, точно никакой!"
					}
				}
			}
		]
		
	],
	
	post : [
		[
			{
				text : "Ты тут вроде хочешь ответить в теме? Помочь тебе?",
				mood : "вопросительно",
				option : {
					list : {
							"Помочь" : {
								text : "Напечатай свой ответ в этом поле. В верхней части окна расположены значки для форматирования текста. Когда закончишь, нажми «Отправить». <br/><br/>Тебе пригодилась эта информация?",
								option : { 
									list : {
										"Да" : { text: "Да ну? Это же сплошная отсебятина!", mood : "извиняющимся тоном" },
										"Нет" : { text : "Скажите пожалуйста! А чего ты от меня ждал? У меня, между прочим, клешни заместо пальцев!", mood : "сердито" }
									}
								}
							},
							"Мне не нужна помощь." : "Ах, простите, что потревожимши, ваше благородие. Разбирайтесь сами!"
					}
				}
			}
		]
	],
	
	newThread : [
		[
			{
				text : "Ты хочешь открыть новую тему? Помочь тебе?",
				mood : "вопросительно",
				option : {
					list : {
							"Подскажи мне что-нибудь." : {
								text : "Выбери что-нибудь вот из этих тем:",
								option : { 
									list : {
										"Крабы" : { 
											text: "<b>Например:</b><br/>Крабы — самый чумовой класс, но что с ними натворили в PTR, это вообще полный ацтой. Если вы мне не верите, приведу документальное подтверждение из таблицы. Близзарды, отзовитесь!", 
											option : {
												list : {
													"Неплохо, мне нравится." : "Ты мне тоже нравишься!",
													"Ну ты отжигаешь, Крабик!" : "Крабы, они такие. Жгут на суше и в море."
												}
											}
										},
										"Ракообразные" : { 
											text : "<b>Например:</b><br/>У моего соседа рыжая кошка. Ее зовут Персик. Я люблю рыжих кошек, потому что они дружелюбные. Сосед как-то подбросил меня до школы. Он хороший чувак. Кошка у него тоже что надо." , 
											option : {
												list : {
													"Сойдет." : "Стараемся.",
													"Я не люблю кошек." : "Да ты что? :("
												}
											}
										},
										"Глубоководная жизнь" : {
											text : "<b>Например:</b><br/>Морские анемооны — отряд морских стрекающих из класса коралловых полипов. Они лишены минерального скелета. Большинство — сидячие организмы, обитающие на твёрдом грунте. Немногие виды перешли к роющему образу жизни в толще донных осадков. [1] Анемоны часто имеют широкие полипообразные щупальца, служащие для переваривания пищи.[2] Крупные виды питаются крабами, двустворчатыми моллюсками, которых смывают волны. Края рта могут набухать и также способствовать захвату добычи. Понерфите магов!",
											option : {
												list : {
													"Учителю биологии это понравится." : "Не забудь указать источник.",
													"Это что, стырено из Википедии?" : "Ну да. А ты что, хотел эксклюзива на халяву?"
												}
											}
										},
										"Понерфите чернокнижников!" : {
											text : "<b>Например:</b><br/>Чернокнижники слишком крутые. Призывать могущественных демонов, вонять горячей серой и неистовствовать — это больно жирно. Поставьте этих полубогов, которым подвластна демоническая скверна, над людишками. И дайте им какого-нибудь хорошего демонического маунта.",
											option : {
												list : {
													"КРУТО!" : "Без ложной скромности — одно из моих лучших произведений.",
													"Неплохо!" : "1:0 в пользу маэстро Краба."
												}
											}
										}
									}
								}
							},
							"Нет, я уже знаю, о чем писать." : "Хорошо! Тогда я тут просто посижу рядышком."
					}
				}
			}
		]
	],

	
	media : [
		[
			"Мама дорогая! Сколько скриншотов! А твоего персонажа тут нет? Не хочешь отправить скриншотик? Чего там, не скромничай!",
			"Прикольные комиксы. Тебе какой больше всего нравится? Мне тот, что с Артасом. ",
			"А в разделе «Материалы», между прочим, тоже можно оставлять комментарии. Обсуждать любимые скриншоты, композиции, фильмы, все дела...",
			"Обоев-то, обоев! Глаза разбегаются! Тебе какие нравятся больше всех?",
			{ 
				text : "Ты, похоже, хочешь отправить фан-арт. Дать тебе пару советов?",
				mood : "вопросительно",
				option : {
					list : {
						"Конечно!" : "• Во-первых, всегда изображай персонажа в позе действия. <br/>• Во-вторых, раз уж у вас, людей, такие умелые ручки, — нарисуй меч или топор, лучше всего, чтобы им вращали в воздухе.<br/>• А, ты уже нарисовал? Покажи-ка. Ну ладно, сойдет. Хотя оружие можно было бы сделать и покрупнее.",
						"А разве крабы умеют рисовать?" : {
							text : "Да я так, баловался помаленьку в свое время.",
							option : {
								list : {
									"Да у тебя же даже рук нет?" : {
										text : "А это, по-твоему, что за отростки?",
										option : {
											list : {
												"Клешни?" : {
													text : "Именно. Я все схватываю на лету!",
													option : {
														list : {
															"У тебя с головой все в порядке?" : {
																text : "Только это и слышу...",
																mood : "вопросительно"
															}
														}
													}													
												},
												"Камертон?" : "Точно, похоже на камертон. <br/>...<br/> Ими можно дотронуться до чего угодно... кроме как друг до друга."
											}
										}										
									},
									"Гони картинку или проваливай!" : {
										text : "Не дави на меня!",
										option : {
											list : {
												"Рожай уже." : {
													text : "Слушай, я к своему искусству, знаешь ли, трепетно отношусь.",
													option : {
														list : {
															"Вот как бухну тебя в кастрюлю с кипятком — вот когда ты у меня затрепещешь!" : {
																text : "Загнать Крабика в угол еще никому не удавалось!",
																mood : "сердито"
															},
															"Ну ладно, Крабик. Убедил. Повешу твою мазню на холодильник." : {
																text : "Смотри: <br/> <center><img src=\"/wow/static/images/game/crabby/crabby-doodle.jpg\"/></center>",
																mood : "с удивлением"
															}
														}
													}													
												}
											}
										}
									}		
								}
							}
						}
					}
				}				
			}
		],
		
		[
			{
				text : "Не хочешь обоев для своего супер-пупер-продвинутого планшета?",
				mood : "вопросительно", 
				option : { 
					list : {
						"Хочу." : "Я тоже не откажусь.",
						"Нет." : "Ну и пожалуйста. Надумаешь жить <em>в <b>XXI веке</b></em>, скажи."
					}
				}
			}
		]

	],
	
	game : [
		[
			"Знакомишься с игрой? Дело хорошее. А я тебе пока, хочешь, вафельку испеку? Или морковки натру? Бугага!",
			"В «Руководстве для начинающих» запрятано пятнадцать секретов. Слабо их все отыскать?",
			"Ты уже знаешь, в разделе «История Warcraft» излагается вся история игры до седьмого колена? Почитай, не пожалеешь!",
			"А как тебе раздел «История Warcraft» про предводителей Альянса и Орды? Помнишь, «Вожак стаи», — правда ведь, здорово? А мне еще очень понравилось про Гарроша и Галливикса. А тебе?",
			"Если ты хочешь создать персонажа нового класса, в разделе «Классы» все довольно толково расписано про каждый класс, что к чему."
		]
	],
	
	services : [
		[
			"В сотовый тыкать уже дажа самая распоследняя мартышка умеет, что уж о тебе говорить! Везет некоторым!.. У нас вот, крабов, с этим пока туговато...",
			"Нужна помощь? Нажми на кнопку «Поддержка», чтобы связаться с нашей чудесной службой поддержки!"
		],
		[
			"Сотрудники службы поддержки поможет сменить или поменять пароль, создать новую учетную запись, перенести персонажей, сообщить об ошибке, рассказать о World of Warcraft, настроить безопасность учетки и заменить сдувшуюся шину."
		],
		[
			"Служба поддержки поможет решить проблемы с другими игроками, переустановить игру, вытащить, если ты застрял, замочить Саргероса, создать группу, пригласить в игру друзей, настроить родительский контроль — и это еще не все!"
		]
	],
	
	item : [
		[
			"Надень все предметы, а то потеряешь ненароком!"
		],
		[
			"Я ни одного из них не знаю лично."
		]
	],
	
	character : [
		[ 
			"Игроки — краеугольный камень World of Warcraft.",
		],
		[ 
			"Кажется, я его знаю."			
		],
		[ 
			"Игроки составляют удивительное и разнообразное семейство плотоядных." 
		],
		[ 
			"" 
		],
	],
	
	loggedOut : [
		{
			text : "Я заметил, что ты не хочешь авторизоваться. Ты пароль не помнишь?",
			mood : "вопросительно",
			option : {
				list : {
					"Нет" : "Тогда нажми на кнопку помощи!",
					"Да" : {
						text : "А как насчет \"password?\"",
						option : {
							list : {
								"Нет" : "Этот мне нравится.",
								"Да" : {
									text: "А как насчет \"password1?\"",
									option : {
										list : {
											"Нет" : "Не сдавайся. У тебя в запасе всего лишь 11 миллиардов вариантов.",
											"Да" : "Это небезопасный пароль. Совсем небезопасный. Немедленно смени его!"
										}
									}									
								}
							}
						}
					}	
				}
			}
		}
	],
	
	weekDay : {
		d5 : [ 
			{
				text : "С пятницей! Я проснулся с этой песней в голове...",
				mood : "вопросительно",
				option : {
					list : {
						"О нет, Крабик!" : "<a href=\"javascript:;\" onclick=\"window.open('http://www.youtube.com/watch?v=CD2LRROpph0')\">О да, Крабик!</a>"
					}
				}
			}
		]
	},
	
	generic : [
		[
			
		],
		[
		],
		[
			"Сотрудники Blizzard никогда не попросят твой пароль. <br/> (Мы просто умеем подбирать пароли.)"
		]
	]

}


if(Crabby.user.character) {
	CrabbyText.generic[0] = CrabbyText.generic[0].concat([
		{ 
			text : "Похоже, что твой класс, " + Crabby.user.character.class + ", в порядке. " + 
				(
					(Crabby.user.character.level >= 85)?"Уровень "+ Crabby.user.character.level +"! Теперь ты играешь на моей территории.":
					 "Давай, дружок, еще"+ (85 - Crabby.user.character.level)+"уровней, и станешь совсем "+((Crabby.user.character.gender == 0)?"большим мальчиком":"взрослой девочкой")+"!"
				 )
		}
	])
}

if(Crabby.item){
	
	if(Crabby.item.id == 44333) {
		CrabbyText.item[0] = [{
			text : "Так вот куда я все положил!",
			mood : "с удивлением"
		}]
							 
	}
	if(Crabby.item.qualityId == 5) {
		CrabbyText.item[0] = [ 
			{ 
				text : "Просто произнеси это название: <b>" + Crabby.item.name +"</b>. Звучит, как название для легендарки.",
				mood : "с удивлением"
			}
		]
	}
	
	if(Crabby.item.qualityId > 1) {
		CrabbyText.item[0].push(
			"Похоже, что охотникам нужна моя добыча!"
		)
	}
		/*
	(if item drops from a Cataclysm boss) (сердито) Darn {bossname}, this never drops for me!
	(if item drops from a non-cata boss) I had this back in the day. Ah, the memories…
		*/
}

if(Crabby.forum) {
	
	if(Crabby.forum.classForum){
			CrabbyText.forum[0].push(
				"Форум классов — отличное место, чтобы почитать о своем классе!"
			)
	}
	
	if(Crabby.forum.dungeonForum){
			CrabbyText.forum[0].push(
				"Мой любимый форум! «Подземелья и рейды»! Когда же я уже смогу тебе помочь в игре?"
			)
	}
	
	if(Crabby.forum.rpForum){
			CrabbyText.forum[0].push(
				"Это раздел общих тем, где мы можем обсуждать все, что не касается World of Warcraft. Хотя погоди. Нет, это не тот форум."
			)
	}

	if(Crabby.topic) {
		
		//Add in topic specific speech 
		CrabbyText.forum[0] = CrabbyText.forum[0].concat([
			"Эту тему просмотрели "+ Crabby.topic.totalViews +" пользователей. Или примерно " + (Crabby.topic.totalViews*2) +" пар глаз, если учитывать циклопов.",
			"Я рад, что пользователь "+ Crabby.topic.user +" запостил эту тему. Кое с чем можно согласиться, как думаешь?",
			{
				text : "Похоже, ты читаешь тему на форуме. Рассказать вкратце, о чем там?",
				mood : "вопросительно",
				option : {
					list : {
						"Конечно." : "Насколько я понял, "+ Crabby.topic.user +" рассказывает довольно интересные вещи. " + ((Crabby.topic.postCount > 1)?"А потом "+(Crabby.topic.postCount-1) +" остальные ему отвечают":"Увы, никому, на самом деле, нет до этого дела."),
						"... Ладно тогда." : { 
							text : "Похоже, я тебя не убедил. У меня полно других дел, если ты просто хочешь запостить ответ.",
							mood : "вопросительно",
							option : {
								list : {
									"Ну, ну, Крабик. Не будь букой." : { 
										text : "Мне просто нужно время.",
										mood : "печально"
										
									},
									"По-моему, это круто." : "Я забыл, о чем мы."
								}
							}
						}
					}
				}
			},
			{ 
				text : "Похоже, ты читаешь форум. Помочь?",
				option: {
					list : {
						"Помощь с чтением форума" : {
							text : "Ух ты, почти никто не ответил. Здорово! Отлично, Крабик, наш выход!",
							option : {
								list : {
									"Чем ты можешь помочь?" : "Прекарсный вопрос! Вообще я не знаю. Знаешь, что. Я просто тут побуду, пока ты читаешь.",
									"Я передумал." : {
										text : "Ну ок. Я тут, если понадоблюсь.",
										mood : "печально"
									}
								}
							}
						},
						"Просто почитай тему." : "Ой, ну ладно, потом обсудим!"
					}
				}
			}
		]);
		
		if( Crabby.topic.postCount > 400 ){
			CrabbyText.forum[0].push(
				"В этой теме больше 20 страниц. Ты помнишь, что можно нажать на кнопку в правом верхнем углу, чтобы попросить прикрепить тему?"
			)
		}
		
		if(Crabby.topic.locked){
			CrabbyText.forum[0].push(
				"Тема закрыта! Можно смотреть, а трогать ни-ни!"
			)
		}
		
		if(Crabby.topic.sticky){
			CrabbyText.forum[0].push(
				"Это прикрепленное сообщение. Название дурацкое, конечно, но темы там обсуждаются важные."
			)
		}
		
	}
}

if (Crabby.character){
	
	CrabbyText.character[0] = CrabbyText.character[0].concat([
			(Crabby.character.guild)?Crabby.character.name + " сейчас в гильдии «" + Crabby.character.guild + "».<br/>Интересно, ведет ли эта гильдия сейчас набор.":Crabby.character.name + " не состоит в гильдии, а ведь это прекрасный способ, чтобы встретить новых друзей!",
		"Если тебе встретится такой суперский игрок, как " + Crabby.character.name + ", обязательно добавь его в друзья. Ведь дружить так здорово!"
	])
	
	CrabbyText.character[1] = CrabbyText.character[1].concat([

		Crabby.character.raceName + "— самая " + ((Math.floor(Math.random() * 2) == 0)?"не":"") + "популярная раса.",
		Crabby.character.className + "— самый " + ((Math.floor(Math.random() * 2) == 0)?"не":"") + "-популярный патч.",
		Crabby.character.className + "ов определенно " + ((Math.floor(Math.random() * 2) == 0)?"понерфят":"баффнут") + " в следующем патче."
	])

	
	if(Crabby.character.averageItemLevel > 333) {
		CrabbyText.character[0].push({ 	
			text : "Этот игрок готов к прохождению героиков Cataclysm!",
			mood : "с удивлением"
		})
	}

}


