<div id="not-verified" class="border-5">
<p><strong>Электронный адрес (<em><?php echo WoW_Account::GetEmail(); ?></em>) еще не прошел проверку.</strong></p>
<div id="email-sent-loading">
<p>Пока вы не подтвердите действительность этого адреса, вы не сможете управлять параметрами игр и пользоваться рядом функций. Проверьте, пожалуйста, почту: вам было выслано контрольное сообщение.</p>
<p><a href="#" onclick="Lobby.sendEmailVerification('send-verification-email.xml');">Запросить контрольное сообщение повторно</a></p>
</div>
<div id="email-sent-wait" style="display:none">
<p>Пока вы не подтвердите действительность этого адреса, вы не сможете управлять параметрами игр и пользоваться рядом функций. Проверьте, пожалуйста, почту: вам было выслано контрольное сообщение.</p>
<p>Идет отправка сообщения.</p>
</div>
<div id="email-sent-error" style="display:none">
<p>При выполнении вашего запроса произошла ошибка.</p>
</div>
<div id="email-sent-success" style="display:none">
<p>На электронный адрес, закрепленный за этой записью, выслано контрольное сообщение.</p><p>Чтобы проверить действительность адреса, загляните в свой почтовый ящик и следуйте указаниям в этом сообщении.</p>
</div>
</div>
